syabyr/lm3s_proj/SW-LM3S-10636/myproject/lm3s8962/temp/sd_card/main.c
//*****************************************************************************
//
// sd_card.c - Example program for reading files from an SD card.
//
// Copyright (c) 2007-2011 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 6852 of the EK-LM3S8962 Firmware Package.
//
//*****************************************************************************

#include <string.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "utils/cmdline.h"
#include "utils/uartstdio.h"
#include "fatfs/src/ff.h"
#include "fatfs/src/diskio.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>SD card using FAT file system (sd_card)</h1>
//!
//! This example application demonstrates reading a file system from
//! an SD card.  It makes use of FatFs, a FAT file system driver.  It
//! provides a simple command console via a serial port for issuing commands
//! to view and navigate the file system on the SD card.
//!
//! The first UART, which is connected to the FTDI virtual serial port
//! on the Stellaris LM3S6965 Evaluation Board, is configured for 115,200
//! bits per second, and 8-n-1 mode.  When the program is started a message
//! will be printed to the terminal.  Type ``help'' for command help.
//!
//! For additional details about FatFs, see the following site:
//! http://elm-chan.org/fsw/ff/00index_e.html
//
//*****************************************************************************

//*****************************************************************************
//
// Defines the size of the buffers that hold the path, or temporary
// data from the SD card.  There are two buffers allocated of this size.
// The buffer size must be large enough to hold the longest expected
// full path name, including the file name, and a trailing null character.
//
//*****************************************************************************
#define PATH_BUF_SIZE   80

//*****************************************************************************
//
// Defines the size of the buffer that holds the command line.
//
//*****************************************************************************
#define CMD_BUF_SIZE    64

//*****************************************************************************
//
// This buffer holds the full path to the current working directory.
// Initially it is root ("/").
//
//*****************************************************************************
static char g_cCwdBuf[PATH_BUF_SIZE] = "/";

//*****************************************************************************
//
// A temporary data buffer used when manipulating file paths, or reading data
// from the SD card.
//
//*****************************************************************************
static char g_cTmpBuf[PATH_BUF_SIZE];

//*****************************************************************************
//
// The buffer that holds the command line.
//
//*****************************************************************************
static char g_cCmdBuf[CMD_BUF_SIZE];

//*****************************************************************************
//
// The following are data structures used by FatFs.
//
//*****************************************************************************
static FATFS g_sFatFs;
static DIR g_sDirObject;
static FILINFO g_sFileInfo;
static FIL g_sFileObject;

//*****************************************************************************
//
// A structure that holds a mapping between an FRESULT numerical code,
// and a string represenation.  FRESULT codes are returned from the FatFs
// FAT file system driver.
//
//*****************************************************************************
typedef struct
{
	FRESULT fresult;
	char *pcResultStr;
}
tFresultString;

//*****************************************************************************
//
// A macro to make it easy to add result codes to the table.
//
//*****************************************************************************
#define FRESULT_ENTRY(f)        { (f), (#f) }

//*****************************************************************************
//
// A table that holds a mapping between the numerical FRESULT code and
// it's name as a string.  This is used for looking up error codes for
// printing to the console.
//
//*****************************************************************************
tFresultString g_sFresultStrings[] =
{
	FRESULT_ENTRY(FR_OK),
	FRESULT_ENTRY(FR_NOT_READY),
	FRESULT_ENTRY(FR_NO_FILE),
	FRESULT_ENTRY(FR_NO_PATH),
	FRESULT_ENTRY(FR_INVALID_NAME),
	FRESULT_ENTRY(FR_INVALID_DRIVE),
	FRESULT_ENTRY(FR_DENIED),
	FRESULT_ENTRY(FR_EXIST),
	FRESULT_ENTRY(FR_RW_ERROR),
	FRESULT_ENTRY(FR_WRITE_PROTECTED),
	FRESULT_ENTRY(FR_NOT_ENABLED),
	FRESULT_ENTRY(FR_NO_FILESYSTEM),
	FRESULT_ENTRY(FR_INVALID_OBJECT),
	FRESULT_ENTRY(FR_MKFS_ABORTED)
};

//*****************************************************************************
//
// A macro that holds the number of result codes.
//
//*****************************************************************************
#define NUM_FRESULT_CODES (sizeof(g_sFresultStrings) / sizeof(tFresultString))

//*****************************************************************************
//
// This function returns a string representation of an error code
// that was returned from a function call to FatFs.  It can be used
// for printing human readable error messages.
//
//*****************************************************************************
const char *StringFromFresult(FRESULT fresult)
{
	unsigned int uIdx;

	// Enter a loop to search the error code table for a matching
	// error code.
	for(uIdx = 0; uIdx < NUM_FRESULT_CODES; uIdx++)
	{
		// If a match is found, then return the string name of the
		// error code.
		if(g_sFresultStrings[uIdx].fresult == fresult)
		{
			return(g_sFresultStrings[uIdx].pcResultStr);
		}
	}

	// At this point no matching code was found, so return a
	// string indicating unknown error.
	return("UNKNOWN ERROR CODE");
}

//*****************************************************************************
//
// This is the handler for this SysTick interrupt.  FatFs requires a
// timer tick every 10 ms for internal timing purposes.
//
//*****************************************************************************
void SysTickHandler(void)
{
	// Call the FatFs tick timer.
	disk_timerproc();
}

//*****************************************************************************
//
// This function implements the "ls" command.  It opens the current
// directory and enumerates through the contents, and prints a line for
// each item it finds.  It shows details such as file attributes, time and
// date, and the file size, along with the name.  It shows a summary of
// file sizes at the end along with free space.
//
//*****************************************************************************
//列出当前文件列表命令处理函数
int Cmd_ls(int argc, char *argv[])
{
	unsigned long ulTotalSize;
	unsigned long ulFileCount;
	unsigned long ulDirCount;
	FRESULT fresult;
	FATFS *pFatFs;

	// Open the current directory for access.
	fresult = f_opendir(&g_sDirObject, g_cCwdBuf);

	// Check for error and return if there is a problem.
	if(fresult != FR_OK)
	{
		return(fresult);
	}

	ulTotalSize = 0;
	ulFileCount = 0;
	ulDirCount = 0;

	// Give an extra blank line before the listing.
	UARTprintf("\n");

	// Enter loop to enumerate through all directory entries.
	for(;;)
	{
		// Read an entry from the directory.
		fresult = f_readdir(&g_sDirObject, &g_sFileInfo);

		// Check for error and return if there is a problem.
		if(fresult != FR_OK)
		{
			return(fresult);
		}

		// If the file name is blank, then this is the end of the
		// listing.
		if(!g_sFileInfo.fname[0])
		{
			break;
		}

		// If the attribue is directory, then increment the directory count.
		if(g_sFileInfo.fattrib & AM_DIR)
		{
			ulDirCount++;
		}

		// Otherwise, it is a file.  Increment the file count, and
		// add in the file size to the total.
		else
		{
			ulFileCount++;
			ulTotalSize += g_sFileInfo.fsize;
		}

		// Print the entry information on a single line with formatting
		// to show the attributes, date, time, size, and name.
		UARTprintf("%c%c%c%c%c %u/%02u/%02u %02u:%02u %9u  %s\n",
			(g_sFileInfo.fattrib & AM_DIR) ? 'D' : '-',
			(g_sFileInfo.fattrib & AM_RDO) ? 'R' : '-',
			(g_sFileInfo.fattrib & AM_HID) ? 'H' : '-',
			(g_sFileInfo.fattrib & AM_SYS) ? 'S' : '-',
			(g_sFileInfo.fattrib & AM_ARC) ? 'A' : '-',
			(g_sFileInfo.fdate >> 9) + 1980,
			(g_sFileInfo.fdate >> 5) & 15,
			g_sFileInfo.fdate & 31,
			(g_sFileInfo.ftime >> 11),
			(g_sFileInfo.ftime >> 5) & 63,
			g_sFileInfo.fsize,
			g_sFileInfo.fname);
	}   // endfor

	// Print summary lines showing the file, dir, and size totals.
	UARTprintf("\n%4u File(s),%10u bytes total\n%4u Dir(s)",
		ulFileCount, ulTotalSize, ulDirCount);

	// Get the free space.
	fresult = f_getfree("/", &ulTotalSize, &pFatFs);

	// Check for error and return if there is a problem.
	if(fresult != FR_OK)
	{
		return(fresult);
	}

	// Display the amount of free space that was calculated.
	UARTprintf(", %10uK bytes free\n", ulTotalSize * pFatFs->sects_clust / 2);

	// Made it to here, return with no errors.
	return(0);
}

//*****************************************************************************
//
// This function implements the "cd" command.  It takes an argument
// that specifes the directory to make the current working directory.
// Path separators must use a forward slash "/".  The argument to cd
// can be one of the following:
// * root ("/")
// * a fully specified path ("/my/path/to/mydir")
// * a single directory name that is in the current directory ("mydir")
// * parent directory ("..")
//
// It does not understand relative paths, so dont try something like this:
// ("../my/new/path")
//
// Once the new directory is specified, it attempts to open the directory
// to make sure it exists.  If the new path is opened successfully, then
// the current working directory (cwd) is changed to the new path.
//
//*****************************************************************************

//切换路径命令处理函数
int Cmd_cd(int argc, char *argv[])
{
	unsigned int uIdx;
	FRESULT fresult;

	// Copy the current working path into a temporary buffer so
	// it can be manipulated.
	strcpy(g_cTmpBuf, g_cCwdBuf);

	// If the first character is /, then this is a fully specified
	// path, and it should just be used as-is.
	if(argv[1][0] == '/')
	{
		// Make sure the new path is not bigger than the cwd buffer.
		if(strlen(argv[1]) + 1 > sizeof(g_cCwdBuf))
		{
			UARTprintf("Resulting path name is too long\n");
			return(0);
		}

		// If the new path name (in argv[1])  is not too long, then
		// copy it into the temporary buffer so it can be checked.
		else
		{
			strncpy(g_cTmpBuf, argv[1], sizeof(g_cTmpBuf));
		}
	}


	// If the argument is .. then attempt to remove the lowest level
	// on the CWD.
	else if(!strcmp(argv[1], ".."))
	{
		// Get the index to the last character in the current path.
		uIdx = strlen(g_cTmpBuf) - 1;

		// Back up from the end of the path name until a separator (/)
		// is found, or until we bump up to the start of the path.
		while((g_cTmpBuf[uIdx] != '/') && (uIdx > 1))
		{
			// Back up one character.
			uIdx--;
		}

		// Now we are either at the lowest level separator in the
		// current path, or at the beginning of the string (root).
		// So set the new end of string here, effectively removing
		// that last part of the path.
		g_cTmpBuf[uIdx] = 0;
	}

	// Otherwise this is just a normal path name from the current
	// directory, and it needs to be appended to the current path.
	else
	{
		// Test to make sure that when the new additional path is
		// added on to the current path, there is room in the buffer
		// for the full new path.  It needs to include a new separator,
		// and a trailing null character.
		if(strlen(g_cTmpBuf) + strlen(argv[1]) + 1 + 1 > sizeof(g_cCwdBuf))
		{
			UARTprintf("Resulting path name is too long\n");
			return(0);
		}

		// The new path is okay, so add the separator and then append
		// the new directory to the path.
		else
		{
			// If not already at the root level, then append a /
			if(strcmp(g_cTmpBuf, "/"))
			{
				strcat(g_cTmpBuf, "/");
			}

			// Append the new directory to the path.
			strcat(g_cTmpBuf, argv[1]);
		}
	}

	// At this point, a candidate new directory path is in chTmpBuf.
	// Try to open it to make sure it is valid.
	fresult = f_opendir(&g_sDirObject, g_cTmpBuf);

	// If it cant be opened, then it is a bad path.  Inform
	// user and return.
	if(fresult != FR_OK)
	{
		UARTprintf("cd: %s\n", g_cTmpBuf);
		return(fresult);
	}

	// Otherwise, it is a valid new path, so copy it into the CWD.
	else
	{
		strncpy(g_cCwdBuf, g_cTmpBuf, sizeof(g_cCwdBuf));
	}
	return(0);
}

//查询当前路径命令出路函数
int Cmd_pwd(int argc, char *argv[])
{
	// Print the CWD to the console.
	UARTprintf("%s\n", g_cCwdBuf);

	// Return success.
	return(0);
}

//cat命令处理函数
int Cmd_cat(int argc, char *argv[])
{
	FRESULT fresult;
	unsigned short usBytesRead;

	//
	// First, check to make sure that the current path (CWD), plus
	// the file name, plus a separator and trailing null, will all
	// fit in the temporary buffer that will be used to hold the
	// file name.  The file name must be fully specified, with path,
	// to FatFs.
	//
	if(strlen(g_cCwdBuf) + strlen(argv[1]) + 1 + 1 > sizeof(g_cTmpBuf))
	{
		UARTprintf("Resulting path name is too long\n");
		return(0);
	}

	// Copy the current path to the temporary buffer so it can be manipulated.
	strcpy(g_cTmpBuf, g_cCwdBuf);

	// If not already at the root level, then append a separator.
	if(strcmp("/", g_cCwdBuf))
	{
		strcat(g_cTmpBuf, "/");
	}

	// Now finally, append the file name to result in a fully specified file.
	strcat(g_cTmpBuf, argv[1]);

	// Open the file for reading.
	fresult = f_open(&g_sFileObject, g_cTmpBuf, FA_READ);

	// If there was some problem opening the file, then return
	// an error.
	if(fresult != FR_OK)
	{
		return(fresult);
	}

	//读取字符到结尾
	do
	{
		// Read a block of data from the file.  Read as much as can fit
		// in the temporary buffer, including a space for the trailing null.
		fresult = f_read(&g_sFileObject, g_cTmpBuf, sizeof(g_cTmpBuf) - 1,
			&usBytesRead);

		// If there was an error reading, then print a newline and
		// return the error to the user.
		if(fresult != FR_OK)
		{
			UARTprintf("\n");
			return(fresult);
		}

		// Null terminate the last block that was read to make it a
		// null terminated string that can be used with printf.
		g_cTmpBuf[usBytesRead] = 0;

		// Print the last chunk of the file that was received.
		UARTprintf("%s", g_cTmpBuf);

		// Continue reading until less than the full number of bytes are
		// read.  That means the end of the buffer was reached.
	}
	while(usBytesRead == sizeof(g_cTmpBuf) - 1);

	// Return success.
	return(0);
}

//若命令为help
int Cmd_help(int argc, char *argv[])
{
	tCmdLineEntry *pEntry;
	UARTprintf("\nAvailable commands\n");
	UARTprintf("------------------\n");

	// Point at the beginning of the command table.
	pEntry = &g_sCmdTable[0];

	// Enter a loop to read each entry from the command table.  The
	// end of the table has been reached when the command name is NULL.
	while(pEntry->pcCmd)
	{
		// Print the command name and the brief description.
		UARTprintf("%s%s\n", pEntry->pcCmd, pEntry->pcHelp);

		// Advance to the next entry in the table.
		pEntry++;
	}
	return(0);
}

//帮助列表
tCmdLineEntry g_sCmdTable[] =
{
	{ "help",   Cmd_help,      " : Display list of commands" },
	{ "h",      Cmd_help,   "    : alias for help" },
	{ "?",      Cmd_help,   "    : alias for help" },
	{ "ls",     Cmd_ls,      "   : Display list of files" },
	{ "chdir",  Cmd_cd,         ": Change directory" },
	{ "cd",     Cmd_cd,      "   : alias for chdir" },
	{ "pwd",    Cmd_pwd,      "  : Show current working directory" },
	{ "cat",    Cmd_cat,      "  : Show contents of a text file" },
	{ 0, 0, 0 }
};


#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
}
#endif

int main(void)
{
	int nStatus;
	FRESULT fresult;


	//系统时钟8MHz
	SysCtlClockSet(SYSCTL_SYSDIV_1 | SYSCTL_USE_OSC |
		SYSCTL_XTAL_8MHZ | SYSCTL_OSC_MAIN);

	//例程中要使用的设备,包括串口,SSI接口,这两种接口都在PORTA上
	SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

	//设置100Hz的系统滴答时钟,FatFs的驱动需要10ms的时间片
	SysTickPeriodSet(SysCtlClockGet() / 100);
	SysTickEnable();
	SysTickIntEnable();

	//使能全局中断
	IntMasterEnable();

	//设置PA0,PA1为串口所用
	GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

	//设置串口0为字符终端
	UARTStdioInit(0);

	//打印一条消息到终端
	UARTprintf("\n\nSD Card Example Program\n");
	UARTprintf("Type \'help\' for help.\n");

	//挂载文件系统,使用逻辑磁盘0
	fresult = f_mount(0, &g_sFatFs);
	if(fresult != FR_OK)
	{
		UARTprintf("f_mount error: %s\n", StringFromFresult(fresult));
		return(1);
	}


	//进入无限循环的用户交互界面
	while(1)
	{
		//打印一条包含当前路径的字符串
		UARTprintf("\nmybays@cortex:%s$ ", g_cCwdBuf);

		//从终端获取命令字符串,以回车结尾
		UARTgets(g_cCmdBuf, sizeof(g_cCmdBuf));

		//处理命令,解析并执行
		//注意,CmdLineProcess函数已经执行并返回处理结果到终端
		nStatus = CmdLineProcess(g_cCmdBuf);

		//处理非法命令
		if(nStatus == CMDLINE_BAD_CMD)
		{
			UARTprintf("Bad command!\n");
		}

		//如果命令的参数过多
		else if(nStatus == CMDLINE_TOO_MANY_ARGS)
		{
			UARTprintf("Too many arguments for command processor!\n");
		}

		//命令执行,出错并返回
		else if(nStatus != 0)
		{
			UARTprintf("Command returned error code %s\n",
				StringFromFresult((FRESULT)nStatus));
		}
	}
}
